{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "CV_Hjeiji_Nabil.e156e4320a915fdb90000.pdf",

  "Banner.Pretitle": "Hi! I'm",
  "Banner.Description": "I'm a <span class='underline'>motivated software engineer</span> passionate about exploring new technologies. I enjoy contributing to innovative projects and continuously learning while writing clean, reusable, and scalable code using <span class='underline'>Angular</span>, <span class='underline'>Spring Boot</span>, and <span class='underline'>modern web tools</span>.",

  "Banner.ActionBtn": "Say Hi",

  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "Engineer in <span class='underline'>Software Engineering</span> from TEK-UP Tunisia with strong experience in both frontend and backend development, specialized in full stack development using <strong>Angular</strong> and <strong>Spring Boot</strong>.",
    "I've completed several internships and academic projects using technologies like Angular, Spring Boot, MySQL, MongoDB, Docker, Kubernetes, Git, and DevOps tools.",
    "My strengths include <strong>agile teamwork</strong>, knowledge of <strong>microservice architectures</strong>, API development, and containerized deployment.",
    "I have also developed full-featured applications for healthcare, agriculture, law firms, sports team management, and freelancing platforms, often using REST APIs and secure authentication with JWT."
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Actia",
      "Title": "Full Stack Developer Intern (Engineer PFE)",
      "Date": "Feb 2025 - Jul 2025",
      "Description": [
        "Developed a runtime trace visualization tool for embedded automotive ECUs (Electronic Control Units).",
        "Implemented features in Java with Eclipse RCP, focusing on memory management and performance optimization.",
        "Version control and collaboration using Tortoise SVN."
      ]
    },
    {
      "Tab": "BarmejTech",
      "Title": "Full Stack Developer Intern",
      "Date": "Jul 2024 - Sep 2024",
      "Description": [
        "Built a fast-food ordering web platform for real-time order scheduling and pick-up.",
        "Full stack implementation using Angular (frontend), Spring Boot (backend), MySQL (database), and containerized with Docker and Kubernetes.",
        "Integrated Spring Security for authentication."
      ]
    },
    {
      "Tab": "BeeCoders",
      "Title": "Frontend Developer Intern",
      "Date": "Jun 2023 - Aug 2023",
      "Description": [
        "Developed a responsive and interactive E-learning platform using Angular and TypeScript.",
        "Managed secure user access via JWT, and collaborated under Scrum methodology using Git."
      ]
    },
    {
      "Tab": "Rs_Manager",
      "Title": "Full Stack Developer Intern (Bachelor PFE)",
      "Date": "Feb 2022 - Jun 2022",
      "Description": [
        "Created a spare parts management platform with Angular (frontend) and Express.js (backend).",
        "Stored product and order data in MySQL and versioned code with Git."
      ]
    }
  ],

  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "Highlighted Project",
  "FeatureProjects.Projects": [
    {
      "Title": "HealthCare",
      "Description": "AI-powered health platform for real-time analysis of symptoms and delivery of medical recommendations using data science techniques.",
      "imgs": [],
      "Technologies": ["Angular", "Django", "MySQL", "Docker", "Kubernetes"]
    },
    {
      "Title": "Agriculture Platform",
      "Description": "Microservices-based agriculture assistant platform enabling farmers to consult engineers, send feedback, and receive email notifications.",
      "imgs": [],
      "Technologies": ["Spring Boot", "MongoDB", "MySQL", "Docker", "Feign", "Eureka", "API Gateway"]
    },
    {
      "Title": "LawFirm",
      "Description": "Case and client management system for law firms including secure access, user dashboards, and legal document organization.",
      "imgs": [],
      "Technologies": ["Spring Boot", "MySQL", "JWT", "Angular"]
    },
    {
      "Title": "Upwork Clone",
      "Description": "Freelance job board clone where users can register, create projects, and collaborate based on mutual interest.",
      "imgs": [],
      "Technologies": ["Spring Boot", "MySQL", "JWT"]
    },
    {
      "Title": "Sports Manager",
      "Description": "Soccer team and match management system including player stats, stadium booking, and weather API integration.",
      "imgs": [],
      "Technologies": ["Angular", "Express.js", "MongoDB", "Git", "Weather API"]
    }
  ],

  "OtherProjects.Title": "More Projects",
  "OtherProjects.Projects": [],

  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "Feel free to reach out if you want to collaborate or discuss new opportunities. I'll respond as soon as I can!",
  "Contact.Btn": "Contact Me"
}
